Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K01.tmx
Source language: en_us
Languages: zh_cn

source: His tattoos
zh_cn: 纹身二三事

source: To him, opening the door of his stepdaughter's house, the woman looks old; much too old to be going out with Stevie.
zh_cn: 哈里呢，打开他的继任女儿屋子的大门，门外就站着一位很显老的妇人。这位妇人很显老，老得得和斯蒂维一起出门。

source: But it is certainly her; he has seen the photos.
zh_cn: —没错，就是这位妇人了。他翻看过她的照片。

source: He says hello too loudly and she hurries through the door followed by her three kids, all four of them dripping wet from the rain.
zh_cn: 他大声的对这位妇人打招呼，她于是就匆匆跑进屋子里去，她的三个子女们也随她一起进了屋。

source: The children - two girls, one boy - rush off into the living room and she removes her jacket. A strip of puddingy flesh is visible; a pierced naval.
zh_cn: 这三个子女，两个女儿，一个儿子则冲到了客厅里，她就褪下了她的上衣，露出了她布丁一般鲜嫩的肌肤，略带些许皱褶。

source: He takes her damp jacket and hangs it on the banister, commiserating with her about the weather.
zh_cn: 他把这位妇人的衣服拿到栏杆上晾起来,为她受的这可恶的天气的罪而忿忿不平。

source: She is attractive, but Stevie should be going with girls his own age, not this Louise woman with her kids and her tired eyes.
zh_cn: 她很激愤，但斯蒂维却和他年纪相仿的女孩子们很处得来，不像这位名叫露易丝的带着她一双儿女，用充满倦意的眼神盯着他的妇人一样激愤。

source: How old is she anyway?
zh_cn: 顺便一提，这位妇人到底有几岁？

source: Twenty-eight? Thirty?
zh_cn: 二十八岁么？还是三十岁？不知道。

source: Too old for Stevie, anyway. Much too old.
zh_cn: 或许对于斯蒂维来说，她的实际年龄应该很大。

source: He tries to introduce himself but before he can, Louise plants a surprising kiss on his cheek.
zh_cn: 他本想来自我介绍一下，可在他开口讲之前，露易丝就在他的脸上吻了一下，这很令他吃惊。

source: "I've been dying to meet you, Harry," she says. "Steve talks about you all the time."
zh_cn: “我可想来见你啦！亲爱的哈里，”她说道，“斯蒂夫老是说起你。”

source: "Really?" Harry says. "Well don't believe it, love. It's all lies."
zh_cn: “真的？”哈里说，“我才不信呢！亲爱的露易丝女士，那一定是谎言。”

source: The two of them laugh.
zh_cn: 他们俩就笑了起来。

source: When he was on the doors, he went for women like her: shapely, thick lipped, mouthy.
zh_cn: 哈利在门口踟蹰的时候，就想找一个像他一样姿态优雅，嘴唇厚厚的，能说会道的女人。

source: He tries hard not to look at the swell of her breasts and the St Christopher that nestles there; the tongue stud that bobs in her mouth.
zh_cn: 他试着不去看她丰满的胸部，因为在上面有着“圣·克里斯多夫”字样的纹身，很显眼；她的嘴唇里也有一些不雅的舌钉之类的小东西。

source: From the top of the stairs, Rhonda looks down.
zh_cn: 朗达则在楼上向下张望。

source: "Is that Steven?" She says.
zh_cn: “那是斯蒂文吗？”朗达问。

source: "Hi Ron," Louise says. "No, Steve's on his way. He's running late."
zh_cn: “嗨！亲爱的朗达，你好！”路易斯说，“这不是斯蒂文，他还在路上呢！他来迟到啦。”

source: "Oh," Rhonda says. "Probably just as well, really. We're still wrapping his presents up here."
zh_cn: “喔，是这样，”朗达说，“可能他一会就到，我们正准备给他的礼物呢！”

source: Behind her, Harry's wife, Eva, waves.
zh_cn: 朗达的背后则是哈里的妻子，艾娃，她向楼下的客人打招呼。

source: To him, pushing past the spray of balloons as they enter the sitting room.
zh_cn: 他于是就推开圆圆的小雨珠，让他们进房间里坐了下来。

source: It's clear that Stevie's in the pub. No question about it.
zh_cn: 斯蒂维就正坐在家里的小酒吧里，这不奇怪。

source: Louise says hello to Rhonda's husband Bill, who's got the kids jumping all over him already, then sits down on the sofa.
zh_cn: 露易丝对朗达的丈夫比尔打招呼，比尔则带着一帮小孩子蹦蹦跳跳的玩乐，看到露易丝打招呼后，就坐在了沙发上。

source: There is no smile on Bill's face.
zh_cn: 比尔表情一脸严峻。

source: His nickname has been Michelin since school because of his weight.
zh_cn: 他因为很胖，就给了他一个诨号：米其林。

source: Bill nods a hello in Louise's direction and goes back to defending himself from the kids.
zh_cn: 他朝露易丝坐的地方点了一下头，就带着一帮小孩子继续玩乐去了。

source: No one's quite sure why they love him so much.
zh_cn: 大家都很纳闷，为啥这帮小孩这么喜欢和比尔玩。

source: While Rhonda is upstairs with Eva, Harry is expected to be in charge.
zh_cn: 朗达和艾娃上楼说事去了后，楼下就靠哈里打点了。

source: Bill won't leave his chair except to piss, so it's down to Harry to offer Louise a drink.
zh_cn: 比尔除了上厕所，一般都把着他的“宝座”沙发不动，所以就由哈里给露易丝斟茶倒水。

source: She asks for a lager.
zh_cn: 露易丝要了一大杯饮品，哈里就去厨房里做饮料去了。

source: As he's about to get to the kitchen, she tells him again that it's great to meet him and that Steve talks about him all the time.
zh_cn: 临走的时候，露易丝再次和哈里说她很高兴和他说话，并重复说斯蒂夫老是谈起哈里本人。

source: "What'll the kids have," Harry says.
zh_cn: “小孩子们，要喝什么呀？”哈里说。

source: "Coke!" The kids scream.
zh_cn: “可口可乐！”孩子们欢快的说。

source: To him, taking two cans and a bottle of Coke from the fridge, Louise's voice sounds gentler than he expected; soft, he thinks, like the hairs on her arms look.
zh_cn: 他就从冰箱里取出两听饮料和一大瓶可乐，露易丝的声音也比先前的要柔和了很多，这很是让哈里意想不到。哈利想：这声音很甜美，犹如她纤细的手臂上的一缕秀发。

source: He opens one of the cans and one of the kids falls off Bill's bulk and starts to cry.
zh_cn: 他就打开了一听饮料，而这时候有个小孩子从比尔的大肚子上摔了下来，并失声啼哭。

source: Louise pleads with them all to behave.
zh_cn: 露易丝就跟小孩子们说规矩点儿。

source: They're bored already and the rain's still pouring so they won't be let out any time soon.
zh_cn: 他们很无聊，因为雨下个不停，大人们又不让出去玩。

source: Outside, the bouncy castle that Rhonda paid all that money for, scrimped all those months for is slowly deflating, rain-bounced and drab under the grey afternoon sky.
zh_cn: 门外呢，朗达花了一大笔钱购置的儿童游乐设施，在这令人生恶的午后阴雨中叫雨给弄泡汤了——它们叫雨给淋得不成样子。

source: To him, looking at it shivering in the rain, it's a fucking waste of money, but still looks like fun.
zh_cn: 他呢，就看着这雨一直在浇淋这悲惨的游乐设施，这真他妈的浪费钱啊！不过也还很好玩。

source: He thinks that after a few beers he'd probably have had a bounce on it. A bounce on it with the kids, like he used to bounce on that space hopper he bought for Stevie.
zh_cn: 他就想到，几听啤酒灌进肚子里后，就着酒瘾在上面乱跳一番，像小孩子们那样，在他买给斯蒂夫的儿童设施上蹦蹦跳跳地玩一通。

source: Stevie used to watch Harry bouncing around on it like some fat kangaroo, laughing and snorting like it was the funniest thing he'd ever seen.
zh_cn: 过去，斯蒂夫还说哈里他跳的像只袋鼠，满怀大笑说这是他见过的最最值得大笑一番的事儿。

source: He was always laughing, was Stevie.
zh_cn: 斯蒂夫总是爽朗的笑着，斯蒂维也一样。

source: To him, taking the drinks through and passing them one by one, it's obvious that the kids are staring at his arms.
zh_cn: 他呢 ，就拿出饮料一瓶一瓶给孩子们喝，同时，孩子们也在盯着他手臂上的印迹看。

source: There are illustrations there; poorly rendered prison tattoos.
zh_cn: 印迹上面很有内容，那是家境不好的记号。

source: Usually he tries to cover them, but because it's hot and stuffy his shirtsleeves are rolled up.
zh_cn: 他常常想盖住这些印迹，但是天气很热，他的袖子又短，遮不住。

source: The kids can see a skull, a naked woman, his name, the cockerel crest of his football team.
zh_cn: 孩子们很容易看到一个骷髅头骨，一个裸体女人的画像，还有他的名字。

source: He only thinks about them when people notice, and normally they don't.
zh_cn: 哈里只是想让人们注意自己，但结果不是那样。

source: The children take their drinks and suck their Cokes through the straws.
zh_cn: 孩子们只顾喝着饮料，用吸管吸着可乐喝。

source: He passes Bill a can and Louise a glass.
zh_cn: 他又递给比尔一听饮料，给露易丝倒了一杯饮料。

source: "You not having one, Harry?" Louise says.
zh_cn: “哈里，你还没喝饮料呢！”露易丝说。

source: He claps his palm to his widow's peak.
zh_cn: 哈里则把手掌重重的拍到窗子上，发出很大的声响。

source: "I'd forget me own head," he says, walking back into the kitchen.
zh_cn: “我想我该一个人静一静，”他说着，就径直向厨房走去。

source: "Could you bring us through some crisps, too, please, Slam?" Bill says.
zh_cn: “请问还能给我们些果酥吗，斯拉姆？"比尔说。

source: Harry nods.
zh_cn: 哈里点了一下头。

source: "Thanks, Slam," he says.
zh_cn: “好的，谢谢。”比尔说。

source: To him, taking a can from the fridge and picking up a bowl of crisps, being called Slam reminds him that he's home.
zh_cn: 他呢，就从冰箱里取出一份果酥，然而，“斯拉姆”这三个字使他不禁想起他的家境。

source: Everyone around here knows him as Slam from his time on the doors - Harry the Slam.
zh_cn: 他身边的每个人都知道哈里刚到这所房子的名字—哈里·斯拉姆。

source: There used to be stories about Harry, stories he'd let settle without straightening out the truth.
zh_cn: 在他身上过去发生过许多事，这些事哈里都难以启齿。

source: People thought he was hard but fair and he liked that.
zh_cn: 大家都知道哈里的日子很艰辛，但那是上天之意，并且哈里本人也乐于此道。

source: The women did too.
zh_cn: 他继任女儿家里的妇女也和哈里一样的想法。

source: He passes the crisps to Bill who starts eating them by the fistful, though the kids are trying to pinch some too.
zh_cn: 他把果酥递给比尔后，比尔就大口大口的吃果酥，尽管孩子们也想大把大把的抓果酥吃，但势头终不及比尔。

source: Harry opens his beer and sits next to Louise.
zh_cn: 哈里就开了一听啤酒，坐在露易丝旁边喝了起来。

source: "So, love, where is he then?" Harry asks Louise.
zh_cn: “嗯，亲爱的，斯蒂维去哪儿啦？”哈里问露易丝。

source: "In the pub I expect."
zh_cn: “我希望还在小酒吧里。”

source: "No, not in the pub," she says tightly.
zh_cn: “不，他不会在小酒吧里，”露易丝直言直语说道，“

source: "He promised me that. He'll be here by three, is what he said."
zh_cn: 他向我承诺过，他下午三点就来这里，他这样说的。”

source: "I'm looking forward to seeing the lad. It's been too long."
zh_cn: “这可真够久的，我现在就想看见那小子！”

source: "He is too," she says. "He's just been busy, that's all."
zh_cn: “可能他很忙吧 ，所以让你们久候不归。”露易丝说。

source: To him, taking out his rolling tobacco, it sounds like an excuse.
zh_cn: 他于是取出一卷烟纸，卷了一根烟，这很像是一种不安的道歉。

source: If he knows Stevie he'll be in the Antelope, wishing he didn't have to spend his twenty-first birthday at his mum's.
zh_cn: 要是他知道斯蒂维在安蒂洛普的话，斯蒂维的21岁生日也许不会在他亲妈家里过了。

source: There are so many sandwiches, things on sticks and shop-bought cakes covering the kitchen that Harry can't even begin to reckon the cost.
zh_cn: 这儿有很多三明治，许多小点心，从商店里买来的很多蛋糕都深深吸引着孩子们的胃口，以至于哈里都来不及结算这次餐会的开销。

source: He licks the adhesive strip on his cigarette and hears Eva and Rhonda clatter down the stairs.
zh_cn: 他舔了舔在烟纸，然后把香烟卷成一条，便抽起烟来，同时，从楼下传来艾娃和朗达的喧嚣声。

source: They say hello to everyone and kiss the kids.
zh_cn: 她俩向大家问好，并吻了孩子们的额头。

source: They are red-cheeked and giggly from the Pomagne.
zh_cn: 没错，从波墨涅来的姑娘们都有着漂亮的粉红脸蛋儿，还很有喜感。

source: Eva introduces herself to Louise and sits down next to Harry.
zh_cn: 艾娃于是向露易丝介绍了自己，随即挨着哈里坐下。

source: "It's so nice to finally meet you, Louise," she says. "I feel like I know you already!"
zh_cn: “百闻不如一见啊，亲爱的露易丝女士，”爱娃说道，“我想我俩定是萍水相逢。”

source: "Me too," Louise says, though Harry suspects she's lying. "When did you make it down?" She says.
zh_cn: “我也是，”尽管哈里察觉露易丝的话言不由衷，露易丝仍礼节性的作答，“什么风把你吹来的？”

source: "Last night. We got the train.
zh_cn: “昨晚我们坐火车过来的。

source: It only took us an hour and a half, didn't it, Harry? We do try to come back as much as we can, but my mother, you know?"
zh_cn: 我们走了一个半小时，是吗，哈里？我们想把这边的是处理完再回去，可是我母亲她——，不说了，你知道我我想说什么的。”

source: "Yeah. Steve did say she's been in the hospital," Louise says. Eva paws the air.
zh_cn: “喔，是的，斯蒂维说过，你母亲她生病住院了。”露易丝说完，艾娃就差点崩溃了。

source: Don't even mention it.
zh_cn: 这事儿最好别提。

source: "She's been out for a month or so now, but the woman never stops complaining, does she, Harry? From morning to night, there's aches and pains and god knows what else.
zh_cn: “她住进医院好几个月了，可这位勇敢的女士从不埋怨，是不，哈里？不管白天黑夜，她老犯肚子痛呀，头痛呀之类的小毛病。

source: She can't see some days and others she says she can't eat, or there's things wrong with her waterworks . . ."
zh_cn: 她好久都没出病房了，饭量也不是很好，再说了，水厂里的那些糗事儿也真够她受的·

source: "How old is she?" Louise asks, wafting away the smoke from Harry's cigarette.
zh_cn: “你母亲贵庚？”露易丝摆了摆手，赶走哈里的烟气，说道。

source: "Ninety-one in September," Eva says.
zh_cn: ““今年九月，她就91岁了。”艾娃说。

source: To him, smoking his roll-up, there's a lot to be said about coming home.
zh_cn: 哈里呢，继续抽着卷烟，要说到为什么他会来这个家，可有一段故事呢。

source: He hates living with his mother-in-law, not because he doesn't like her - they actually have a bit of a laugh when Eva isn't around - but because he hates the drab estate, the people he doesn't know, the anonymity of it all.
zh_cn: 哈里不喜欢和他的老岳母住在一起，不是讨厌她——事实上，艾娃不在的时候，他俩挺谈得来，也不是他老岳母是个把着那点财产不放的老太婆，这个中原因，谁也说不清。

source: "So do you miss it?" Louise says, like she's reading his thoughts.
zh_cn: “那么，你是在想那点财产吧？”露易丝说道，好像她一眼就能看穿哈里的小算盘。

source: He rubs his chin.
zh_cn: 哈里呢，托着下巴，略有所思。

source: "I miss the people, I suppose. And I miss Stevie. So yeah, I suppose I do."
zh_cn: “我想，我在思念我岳母了，嗯，也思念斯蒂维，我知道我在干什么。”

source: "I'd leave here tomorrow," she says. "If it wasn't for the kids and for Steve, and . . . well, given half of one I'd leave just like that."
zh_cn: “露易丝说，“我想，明天我得出一趟远门，要不是为了孩子们还有斯蒂夫，我···唉，算了！不管怎么说，我都得远离这个是非之地。”

source: To him, drumming his fingers on the arm of the chair, the waiting has become excruciating.
zh_cn: 哈里就在椅子上这么无聊的敲击着，而漫长的等待也变得那么令人沮丧。

source: The kids are moaning, already acting up.
zh_cn: 孩子们都被这漫长的等待折磨得无聊至极，显现出了调皮的天性。

source: Eva is quietly panicked.
zh_cn: 艾娃则惊慌失措的照看着这帮小孩。

source: Louise just drinks her lager and occasionally looks at her outsized watch.
zh_cn: 露易丝喝着她的大杯饮料，瞟了一眼她那戴在手腕上的尺寸不符的手表。

source: No one else has arrived.
zh_cn: 等了半天，谁都没有来。

source: Rhonda is flitting about the place as the rain lashes the window panes.
zh_cn: 朗达看着这被暴雨猛烈冲击的窗格，倒是对外面的游乐设施持有一种开朗的态度。

source: "We've got loads of people coming, you know?" Rhonda says to no one in particular. "I do hope there'll be enough food."
zh_cn: “今天要准备一大帮客人的饭菜呢！”朗达特别的旁若无人的说着，“我希望食物都还能凑合着用。”

source: "There'll be enough food, love," Eva says. "There's more food in there than up at the Asda."
zh_cn: “亲爱的，食物当然够用，这儿的食物可比在艾斯达那鬼地方的食物多了很多。”艾娃说。

source: They both laugh and Louise excuses herself to got to the bathroom.
zh_cn: 她俩都笑了出来，而露易丝就借故上洗手间去了。

source: For a moment, Harry feels lost, then he looks down at the floor. Sat by his leg is Louise's eldest child, Sam.
zh_cn: 可不一会儿，哈里就倍感失落，坐在门口惆怅的望着外面。

source: He is alone reading a comic.
zh_cn: 露易丝的大儿子则坐在他的大腿上，读着一本笑话集。

source: "What's that you're reading there?" Harry asks.
zh_cn: “小伙子，你读的什么书啊？”哈利问。

source: "Hulk," the kid says.
zh_cn: “关你屁事儿？”这个小孩说。

source: "Don't make me angry," Harry says. "You won't like me when I'm angry."
zh_cn: “别惹老子发火，跟你说，我发火的样子让你终身难忘！”哈里说。

source: The kid looks alarmed and retreats still further behind the comic.
zh_cn: 这个小孩儿听了倒有警惕了很多，生怕被打，拿着书，躲到远远的。

source: He finishes his cigarette and stubs it out.
zh_cn: 哈里抽完了烟，顺手一弹，烟头飞了出去。

source: Louise returns and smiles sweetly.
zh_cn: 露易丝转过头来对了，对着哈里甜甜地笑了笑。

source: Harry smiles back.
zh_cn: 哈利也咧开嘴微微一笑。

source: If he were twenty years younger.
zh_cn: 要是哈里再年轻20年，他的笑容肯定有魅力。

source: To him, leaning across to get Louise's attention, it doesn't matter that Stevie's not here.
zh_cn: 哈里就躺在门槛那儿，以期引起露易丝注意，还好斯蒂维不在这，要不然就倒霉了。

source: Let the lad have his fun, he thinks.
zh_cn: 他就想，博美人一笑。

source: Then the doorbell goes.
zh_cn: 随后门铃出响了起来。

source: Everyone pauses, even the kids.
zh_cn: 大家都停止活动，小孩子们也静了下来。

source: Rhonda is in the kitchen.
zh_cn: 朗达则在厨房里。

source: Harry gets up and pats Eva on the leg.
zh_cn: 于是哈里就爬起来，在露易丝腿上拍了一下。

source: "I'll go," he says loudly and gets the door. It is another bunch of kids and a couple he doesn't recognise.
zh_cn: “我去吧，”他大声的说出来并到门那里，开了门，门外又来了一拨小孩，还有一对夫妇，他以前都没见过他们。

source: "Hi there," the man says. "Ste said for us to pop round."
zh_cn: “喂，你们好！”这个男的说，“斯蒂维叫我来跟你们打个照面。”

source: He is chisel haired and dressed in faded jeans and a football jersey.
zh_cn: 这个男的留一个平头，穿一条休闲裤，还套一件球衣。

source: "You must be Harry, right?" He says holding out his hand. "I'm Glen. And this is Donna. Ste talks about you all the time, you know that?"
zh_cn: “你就是哈里了，对吧？”他把手伸出来，做握手状，说，“我叫格林，这是多娜，她老是说起你，你知道不？”

source: "It's all lies," Harry says with a thin smile and shows them in.
zh_cn: “怎么可能！”哈里笑着说，并示意让他们进屋。

source: Donna is hard faced; her mascara has run: she looks like she's been punched. She looks familiar.
zh_cn: 多娜表情严峻，她那精巧打扮的眼睫毛早跑了妆。总的来说，她的脸看上去就像挨了一顿揍，看起来非一般的严峻。

source: Harry, half ashamedly, wonders whether he fucked her mum once.
zh_cn: 哈里呢，就半遮半掩得想，这女的看上去就像操她一顿。

source: To him, wedged in the kitchen eating a sausage roll, the place is already too full.
zh_cn: 哈里就缩在厨房里，一个人闷闷地吃着香肠，因为客厅里早就人满了。

source: And there isn't enough food, and Stevie still hasn't turned up.
zh_cn: 家里面也没有太多的食物，斯蒂维始终也没有露脸。

source: In the lounge, there are people dancing and outside the rain has finally stopped.
zh_cn: 客厅里呢，因为雨停了，所以大家都又唱又跳，欢庆这讨人烦的鬼天气的结束。

source: Eva and Rhonda are standing by the cooker, talking about the father of Louise's kids.
zh_cn: 艾娃和朗达正要做饭，就顺便谈到了露易丝的孩子们的父亲。

source: Harry wonders how that man feels about Stevie looking after these kids. It must rip him up inside to see Stevie about with them.
zh_cn: 哈里也很纳闷进来的这个男的和斯蒂维有某种联系，就像他和这些孩子一样。这使得他忍不住想要从这个男的嘴里问出一些事儿。

source: Buying them sweets, taking them places. He used to take Stevie up to the park to watch the kites. He used to buy him sweets too.
zh_cn: 想起以前给斯蒂维买糖果，像宠现在这些孩子一样宠他；以前还常常带他去公园里放风筝，给他买糖果等趣事。

source: Bill was in and out of the hospital back then, and Harry liked the little adventures he and Stevie used to have: the afternoons sat outside the Antelope. People asked if it was his son and he didn't correct them.
zh_cn: 比尔因为太胖了，所以就背地里去医院做手术好几次···每每想起这些事，哈里总能找出一些新乐子，而这些则是他和斯蒂维共有的美好回忆。还有以往那在安蒂洛普午后日光浴，以及人们总拿斯蒂维当他的亲儿子。

source: To him, brushing crumbs from the front of his shirt, those days seem a lifetime ago. He looks around and feels like he needs some air.
zh_cn: 斯蒂维离开这个家以后，哈里就差不多一天到晚拿着他的刷子刷他衬衣上的细毛，这些日子真是度日如年那！他真想出去透透气。

source: He pushes past a group of people he doesn't recognise and taps Rhonda on the shoulder.
zh_cn: 于是就推搡开那些他不认识的人，拍了拍朗达的肩膀，暗示她有些话要说。

source: "You think I should get the bouncy castle up and running? Rain's stopped."
zh_cn: “雨停了，你是想让孩子们出去玩一会儿吧？”

source: She nods.
zh_cn: 哈里点了点头。

source: "Good idea," she says, but doesn't move.
zh_cn: “这主意不错。”朗达就说道，但也没叫孩子们出去玩。

source: "I'll get it started then," he says.
zh_cn: “我现在就去修一下那个游乐场。”哈里就说道。

source: To him, standing looking at the puddles settled in the plastic tubing, it would probably be better if Stevie didn't come at all.
zh_cn: 哈里就站在游乐场前盯着那些塑料零件看，心想还好斯蒂维不在这儿，要不然他又要大闹一次。

source: He wonders whether it would be the right thing to do to warn the boy off. It would be their secret.
zh_cn: 哈里就想他当初该不该把这个可怜的孩子撵出家门（这是哈里一家的最高机密）！

source: He imagines what would happen if he did.
zh_cn: 他也想到一旦这个可怜的孩子出了家门后，就会受冻挨饿，最后死去。

source: He wonders what Louise would look like all fierce and spiteful.
zh_cn: 那露易丝得知后会为斯蒂维感到愤慨还有惋惜。
